//- Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"]; Потрібно зробити перевірку якщо
//  кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//  Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

 let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];

if (friends.length >= 3) {
    console.log("Це великий масив, в якому  3 і більше елементи");
 } else {
    console.log("Це маленький масив, в якому менше 3-х елементів");
 }

// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

 let a = +prompt("Введіть число")
 let b = +prompt("Введіть число")
 let c = +prompt("Введіть число")

 if (b<c && b>a) {
     console.log(b)
 }else if (a > b && a < c) {
     console.log(a);

 }
else if (a===b && b===c  )
 {
console.log("Числа рівні ")
 }

else {
     console.log(c)
 }

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором


let number = +prompt("Введіть число: ");
let decision = number >= -100 && number < 0 ? "Число негативне" : number === 0 ? "Число = 0" : number > 0 && number <= 100 ? "Число позитивне" : "Число інше";
console.log(decision)